# ====== Cross-platform CLI ======
# Improved shell history, stored in SQLite and syncable across machines
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fix common misspellings in source code and text files
brew "codespell"
# Maintained ctags implementation
brew "universal-ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Read and write EXIF metadata (yazi "Show EXIF" opener)
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Distributed revision control system
brew "git"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# SVG rendering library (imagemagick's svg delegate: rsvg-convert)
brew "librsvg"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Unified display of technical and tag data for audio/video (yazi media preview)
brew "media-info"
# Media player (yazi "play" opener)
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Polyglot runtime/version manager (replaces fnm + pyenv)
brew "mise"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Painless compression and decompression (yazi archive preview/compress)
brew "ouch"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package installer and resolver
brew "uv"
# SVG rendering tool (yazi's builtin svg previewer)
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ping with a real-time graph
brew "gping"
# TCP connect to the given IP/port combo
brew "tcping"
if OS.linux?
  # Terminal multiplexer
  brew "tmux"
  # Plugin manager for tmux
  brew "tpm"
end
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Multi-shell unified completion engine for 600+ CLIs
brew "carapace"
# Git in your tmux status bar.
tap "arl/arl"
brew "arl/arl/gitmux"

# ====== macOS only ======
if OS.mac?
  tap "felixkratz/formulae"
  # User interface to the TELNET protocol
  brew "telnet"
  # Mac App Store command-line interface
  brew "mas"
  # Watch files and take action when they change
  brew "watchman"
  # `trash` CLI for the del alias — over the macOS-native /usr/bin/trash it
  # fixes Finder "Put Back" and adds --interactive. Linux side: apt trash-cli.
  brew "macos-trash"
  # A window border system for macOS
  brew "felixkratz/formulae/borders"
  # [DEPRECATED] yabai/skhd → replaced by aerospace
  # brew "koekeishiya/formulae/skhd"
  # brew "koekeishiya/formulae/yabai"

  # GPU-accelerated cross-platform terminal emulator
  # [DEPRECATED] wezterm → wezterm@nightly (stable stalled at 2024-02)
  # cask "wezterm"
  cask "wezterm@nightly"
  # AeroSpace is an i3-like tiling window manager for macOS
  cask "aerospace"
  # Enable Windows-like alt-tab
  cask "alt-tab"
  # Tool to remove unnecessary files and folders from disk
  cask "cleanmymac"
  # Developer targeted fonts with a high number of glyphs
  cask "font-hack-nerd-font"
  # Nerd Font patched version of 0xProto
  cask "font-0xproto-nerd-font"
  # Sans-serif variant of "San Francisco" by Apple
  cask "font-sf-pro"
  # Web browser
  cask "google-chrome"
  # JetBrains tools manager
  cask "jetbrains-toolbox"
  # Keyboard customiser
  cask "karabiner-elements"
  # Media player
  cask "movist-pro"
  # App to write, plan, collaborate, and get organised
  cask "notion"
  # Control your tools with a few keystrokes
  cask "raycast"
  # Tool to reverse the direction of scrolling
  cask "scroll-reverser"
  # Tool that provides consistent, highly configurable symbols for apps
  cask "sf-symbols"
  cask "keyclu"

  mas "Hidden Bar", id: 1452453066
  mas "Microsoft PowerPoint", id: 462062816
  mas "OneDrive", id: 823766827
  mas "QuickFTP", id: 1451646819
  mas "RunCat", id: 1429033973
  mas "Vimari", id: 1480933944
end
