tap "arl/arl"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fix common misspellings in source code and text files
brew "codespell"
# Maintained ctags implementation
brew "universal-ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast Node.js version manager
brew "fnm"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package installer and resolver
brew "uv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# TCP connect to the given IP/port combo
brew "tcping"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Sans-serif variant of "San Francisco" by Apple
cask "font-sf-pro"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Media player
cask "movist-pro"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
cask "keyclu"

mas "Hidden Bar", id: 1452453066
mas "Microsoft PowerPoint", id: 462062816
mas "OneDrive", id: 823766827
mas "QuickFTP", id: 1451646819
mas "RunCat", id: 1429033973
mas "Vimari", id: 1480933944
